//
/**
* Задача 1:
* Условие:
Числото N се въвежда от потребителя.
Трябва да отпечатате пирамида, където на всеки ред числата започват от 1 и стигат до номера на реда.
Използвайте вложен цикъл (for).


Пример:
Въведете число: 5
1
1 2
1 2 3
1 2 3 4
1 2 3 4 5
*/
// Created by Dimitar Penchev on 20.03.25.
//

#include <iostream>
using namespace std;
int main(){

  int n;
  cout << "Въведете число: ";
  cin >> n;

  for(int i = 1; i <= n; i++){
    for(int j = 1; j <= i; j++){
      cout << j << " ";
    }
    cout << endl;
  }
  return 0;
}