//
/**
* Задача 2:
* Напишете програма, която позволява на потребителя да въведе N числа едно по едно (без масив). След това програмата проверява дали дадено число X се среща сред тях. Ако числото бъде намерено, програмата спира търсенето с break и отпечатва на кой опит е било въведено.

Условие:
Потребителят първо въвежда брой числа (N).
След това въвежда N числа едно по едно.
След всяко въведено число проверявате дали то е равно на X.
Ако намерите числото, отпечатвате на кой опит се е появило и излизате от цикъла с break.
Ако числото X не бъде намерено, извеждате съобщение след края на цикъла.
*/
// Created by Dimitar Penchev on 20.03.25.
//

#include <iostream>
#include <string>
using namespace std;
int main() {
    int N, X, K;
    bool isFound = false;
    cout<<"N: ";
    cin>>N;
    cout << "X: ";
    cin>>X;

    for (int i = 1; i <= N; i++) {
        cout<<"Въведете число: ";
        cin >> K;
        if (K==X) {
            cout << "Числото " << K <<" е намерено на позиция " << i << endl;
            isFound = true;
            break;
        }

    }
    if (!isFound) {
        cout << "Числото " << X << " не е намерено" << endl;
    }

    return 0;
}

